# 8. ในการตรวจสอบเลขที่บัตรประชาชนนั้นทำได้โดยการใช้ Check Digit โดยใช้ตัวเลขหลักสุดท้ายในการตรวจสอบ Algorithm ของวิธีการใช้ Check Digit มีดังนี้
#
# ตัวเลขบนบัตรประชาชนจะมีทั้งหมด 13 หลัก นำเลขใน 12 หลักแรก มาคูณกับเลขประจำตำแหน่ง (เลขประจำหลักได้แก่ 13 บวก 1 ลบด้วยตำแหน่งที่) จะได้ตัวเลขประจำตำแหน่งดังนี้
# หลังจากนั้นเอาผลคูณของทั้ง 12 หลักมารวมกัน แล้วหารเอาเศษด้วย 11
# เอาเศษที่ได้จากการหารในข้อ 2 มาลบด้วย 11 เท่านี้ก็ได้เลขที่เป็น Check Digit แล้ว (ถ้าผลจากข้อ 2 ได้ 10 ให้เอาเลขหลักหน่วยเป็น Check Digit ก็คือ 0 นั่นเอง)
# ตัวอย่าง 1-2345-67890-12-1
#
# นำไปคูณเลขประจำตำแหน่ง : (1*13)+(2*12)+(3*11)+(4*10)+(5*9)+(6*8)+(7*7)+(8*6)+(9*5)+(0*4)+(1*3)+(2*2) = 352
# หารเอาเศษด้วย : 11 352%11= 0
# นำ 11 ตั้งแล้วลบเศษที่ได้จากการหารในข้อ 2 : 11 – 0 = 11 (เอาเลขหลักหน่วย) ดังนั้น Check Digit คือ 1
# จะได้ : 1-2345-67890-12-1
#
# เขียนโปรแกรมเพื่อรับค่าเลขประชาชน

ID12 = input("Give me ur ID(only 12 digits)\n")
ID12 = int(ID12)

V12 = ID12 // 10**11
V11 = (ID12%10**11) // 10**10
V10 = (ID12%10**10) // 10**9
V9 = (ID12%10**9) // 10**8
V8 = (ID12%10**8) // 10**7
V7 = (ID12%10**7) // 10**6
V6 = (ID12%10**6) // 10**5
V5 = (ID12%10**5) // 10**4
V4 = (ID12%10**4) // 10**3
V3 = (ID12%10**3) // 10**2
V2 = (ID12%10**2) // 10**1
V1 = (ID12%10**1) // 1
# 123456789012
# 100000000000

calculate = V12*13 + V11*12 + V10*11 + V9*10 + V8*9 + V7*8 + V6*7 + V5*6 + V4*5 + V3*4 + V2*3 + V1*2
reminder = calculate%11
result = 11-reminder
print("Your last digit is ",result)